[
    {
      "id": 1,
      "title": "5 Must-Read Fantasy Books in 2024",
      "date": "January 5, 2024",
      "image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/04/most-anticipated-fantasy-books-2024.jpg?q=70&fit=crop&w=1100&h=618&dpr=1",
      "category": "FANTASY",
      "longDescription": "Dive into worlds filled with magic and adventure with our top 5 fantasy book picks of 2024. From epic sagas to character-driven novels, these books are sure to transport you to different realms."
    },
    {
      "id": 2,
      "title": "Top 10 Mystery Novels That Will Keep You Guessing",
      "date": "February 12, 2024",
      "image": "https://s.yimg.com/ny/api/res/1.2/Nn6.tL8CFMnjFBxN8AMNyA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04OTQ7Y2Y9d2VicA--/https://media.zenfs.com/en/purewow_185/8b0cea0a1d3ab198a167ca1a9a445bff",
      "category": "MYSTERY",
      "longDescription": "Discover the top 10 mystery novels that will have you on the edge of your seat. These novels feature gripping plots, unexpected twists, and unforgettable characters."
    },
    {
      "id": 3,
      "title": "The Best Science Fiction Books of the Decade",
      "date": "March 22, 2024",
      "image": "https://discoverscifi.com/wp-content/uploads/2021/04/The-Top-10-Co-Written-Sci-Fi-Books-of-all-Time-1-1030x584.png",
      "category": "SCIENCE FICTION",
      "longDescription": "Explore the best science fiction books of the past decade. These novels take readers on thrilling adventures through time, space, and futuristic societies while tackling profound themes of technology and humanity."
    },
    {
      "id": 4,
      "title": "10 Non-Fiction Books to Broaden Your Horizons",
      "date": "April 15, 2024",
      "image": "https://wp.penguin.co.uk/wp-content/uploads/2020/07/vintage-in-article-Image-june-02-1.jpg",
      "category": "NON-FICTION",
      "longDescription": "Expand your understanding of the world with these 10 non-fiction books. Covering topics from history to science, these books will challenge your views and introduce new perspectives."
    },
    {
      "id": 5,
      "title": "A Beginner's Guide to Classic Literature",
      "date": "May 3, 2024",
      "image": "https://miro.medium.com/v2/resize:fit:1400/format:webp/1*GAIsrXGT12LzpqCjpJXIeA.png",
      "category": "CLASSICS",
      "longDescription": "Not sure where to start with classic literature? This beginner's guide introduces you to some of the most timeless literary works that continue to shape modern literature and culture."
    }, 
    {
        "id": 6,
        "title": "The Art of Storytelling: A Guide to Fiction",
        "date": "September 10, 2023",
        "image": "https://cdn.shopify.com/s/files/1/0259/7876/5396/files/2023_02_Storytelling_Blog_1200x720_bb4eef5f-8537-400d-b1b6-e43f791a267d.jpg?v=1676580490",
        "shortDescription": "Explore the timeless techniques of crafting engaging narratives in fiction writing.",
        "longDescription": "Storytelling has been an essential human activity since the dawn of civilization. This guide covers the fundamentals of fiction, including how to create compelling characters, construct plot arcs, and evoke emotions in readers. Whether you're an aspiring novelist or a seasoned writer looking to improve your craft, this book offers practical insights into the art of storytelling."
      },
      {
        "id": 7,
        "title": "Mastering Non-Fiction: Crafting Powerful Narratives",
        "date": "August 15, 2023",
        "image": "https://blueroseone.com/publish/wp-content/uploads/2023/06/list-of-10-best-non-fiction-books-of-all-time-that-you-must-read.png",
        "shortDescription": "A deep dive into the techniques for writing compelling non-fiction books.",
        "longDescription": "Non-fiction requires a balance between factual accuracy and compelling storytelling. In this book, authors and journalists explore strategies for engaging readers while staying true to facts. From memoirs to investigative journalism, learn how to tell true stories that captivate your audience, blending facts with narrative techniques to maintain reader interest."
      },
      {
        "id": 8,
        "title": "Children’s Classics: 10 Must-Read Books for Every Child",
        "date": "July 20, 2023",
        "image": "https://img1.rapidleaks.com/2020/07/best-books-for-children.jpg",
        "shortDescription": "Discover 10 classic children's books that have stood the test of time.",
        "longDescription": "Children’s literature has a rich history, and some books have become timeless classics. This post explores ten must-read children's books, from 'Alice in Wonderland' to 'Where the Wild Things Are.' Each selection is chosen for its enduring appeal, imaginative storytelling, and the moral lessons that continue to resonate with young readers."
      },
      {
        "id": 9,
        "title": "The Power of Poetry: Inspiring Collections for Modern Readers",
        "date": "June 30, 2023",
        "image": "https://assets.penguinrandomhouse.com/wp-content/uploads/2018/03/08090727/1200x628_-Backlist_Poetry.jpg",
        "shortDescription": "A collection of inspiring poetry books that speak to the modern soul.",
        "longDescription": "Poetry has the power to stir emotions, challenge perceptions, and inspire change. This blog post introduces a collection of modern and classic poetry that every lover of verse should read. From Rupi Kaur's 'Milk and Honey' to Mary Oliver's 'Devotions,' these poems are a testament to the power of words and rhythm in shaping the way we see the world."
      },
      {
        "id": 10,
        "title": "Behind the Scenes: How Famous Authors Create Their Masterpieces",
        "date": "May 5, 2023",
        "image": "https://thewritepractice.com/wp-content/uploads/2018/09/Inside-the-Mind-of-a-Writer-Writing-a-Book-1.jpg",
        "shortDescription": "Peek into the creative process of famous authors and how they craft their iconic works.",
        "longDescription": "Ever wondered how famous authors create their iconic works? This book provides a behind-the-scenes look at the creative processes of some of the most well-known writers. Learn about their habits, rituals, and inspirations that helped them produce works like 'The Great Gatsby' and 'To Kill a Mockingbird.' This insightful read is perfect for aspiring authors and literary fans alike."
      }
  ]
  